Config/InformationRegisters/КорректныеКорреспонденцииСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КорректныеКорреспонденцииСчетов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/КорректныеКорреспонденцииСчетов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	НеДобавлятьСубсчета = ПараметрыЗаписи.Свойство("НеДобавлятьСубсчета") И ПараметрыЗаписи.НеДобавлятьСубсчета; 
	Если НЕ НеДобавлятьСубсчета
		И ЗначениеЗаполнено(Запись.СчетДт) И ЗначениеЗаполнено(Запись.СчетКт)
		И ЕстьСубсчетаУСчетов(Запись.СчетДт, Запись.СчетКт) Тогда
		
		ТекстВопроса = НСтр("ru = 'В указанной корреспонденции обнаружены счета, имеющие подчиненные счета (субсчета).
		|
		|Добавить субсчета в набор корреспонденций (будет открыта форма выбора субсчетов)?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Добавить субсчета'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Добавить только указанную корреспонденцию'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьСубсчетаЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьСубсчетаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Записать(Новый Структура("НеДобавлятьСубсчета", Истина));
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("СчетДт, СчетКт, Комментарий", Запись.СчетДт, Запись.СчетКт, Запись.Комментарий);
		ОткрытьФорму("РегистрСведений.КорректныеКорреспонденцииСчетов.Форма.ФормаСпискаКорреспонденций", ПараметрыФормы);
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСубсчетаУСчетов(СчетДт, СчетКт)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |ГДЕ
	               |	ЕПСБУ.Родитель = &СчетДт
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |ГДЕ
	               |	ЕПСБУ.Родитель = &СчетКт";
	Запрос.УстановитьПараметр("СчетДт", СчетДт);
	Запрос.УстановитьПараметр("СчетКт", СчетКт);
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // ЕстьСубсчетаУСчетов()

#КонецОбласти
